; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v10 ?v8)
             (pred_4 ?v3 ?v6)
             (pred_10 ?v10 ?v6)
             (pred_5 ?v9 ?v10 )
	     (pred_8 ?v10)
             (pred_1 ?v5)
             (pred_6 ?v3)
             (pred_9 ?v6)
             (pred_2 ?v10)
             (pred_11 ?v3)
             (pred_3 ?v10)
             (pred_7 ))



(:action op_2
:parameters (?v1 ?v11 ?v2 ?v12)
:precondition (and (pred_1 ?v1) (pred_1 ?v11) (pred_6 ?v2) (pred_9 ?v12)
          (pred_12 ?v1 ?v11) (pred_4 ?v2 ?v12)
                   (pred_10 ?v11 ?v12) (pred_8 ?v1) 
                   (pred_2 ?v11) (pred_11 ?v2))
:effect (and  (pred_3 ?v11) (not (pred_2 ?v11))))


(:action op_5
:parameters (?v1 ?v4)
:precondition (and (pred_1 ?v1) (pred_1 ?v4)
               (pred_8 ?v1) (pred_12 ?v1 ?v4) (pred_3 ?v4))
:effect (and (pred_8 ?v4) (not (pred_8 ?v1))))

(:action op_1
:parameters (?v1 ?v2)
:precondition (and (pred_1 ?v1) (pred_6 ?v2) 
                  (pred_8 ?v1) (pred_5 ?v2 ?v1) (pred_7 ))
:effect (and (pred_11 ?v2)
   (not (pred_5 ?v2 ?v1)) (not (pred_7 ))))


(:action op_4
:parameters (?v1 ?v7 ?v13)
:precondition (and (pred_1 ?v1) (pred_6 ?v7) (pred_6 ?v13)
                  (pred_8 ?v1) (pred_11 ?v13) (pred_5 ?v7 ?v1))
:effect (and (pred_11 ?v7) (pred_5 ?v13 ?v1)
        (not (pred_11 ?v13)) (not (pred_5 ?v7 ?v1))))

(:action op_3
:parameters (?v1 ?v2)
:precondition (and (pred_1 ?v1) (pred_6 ?v2) 
                  (pred_8 ?v1) (pred_11 ?v2))
:effect (and (pred_7 ) (pred_5 ?v2 ?v1) (not (pred_11 ?v2)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_05 obj_25 obj_18 obj_27 obj_14 obj_26 obj_23 obj_17 obj_29 obj_01 obj_02 obj_30 obj_20 obj_15 obj_19 obj_22 obj_21 obj_11 obj_03 obj_06 obj_10 obj_08 obj_24 obj_04
    obj_13 obj_28
    obj_16 obj_12 obj_09
    )

    (:init
       (pred_7)

       (pred_1 obj_07)
       (pred_1 obj_05)
       (pred_1 obj_25)
       (pred_1 obj_18)
       (pred_1 obj_27)
       (pred_1 obj_14)
       (pred_1 obj_26)
       (pred_1 obj_23)
       (pred_1 obj_17)
       (pred_1 obj_29)
       (pred_1 obj_01)
       (pred_1 obj_02)
       (pred_1 obj_30)
       (pred_1 obj_20)
       (pred_1 obj_15)
       (pred_1 obj_19)
       (pred_1 obj_22)
       (pred_1 obj_21)
       (pred_1 obj_11)
       (pred_1 obj_03)
       (pred_1 obj_06)
       (pred_1 obj_10)
       (pred_1 obj_08)
       (pred_1 obj_24)
       (pred_1 obj_04)
       (pred_9 obj_13)
       (pred_9 obj_28)
       (pred_6 obj_16)
       (pred_6 obj_12)
       (pred_6 obj_09)

       (pred_12 obj_07 obj_14)
       (pred_12 obj_07 obj_05)
       (pred_12 obj_05 obj_26)
       (pred_12 obj_05 obj_25)
       (pred_12 obj_05 obj_07)
       (pred_12 obj_25 obj_23)
       (pred_12 obj_25 obj_18)
       (pred_12 obj_25 obj_05)
       (pred_12 obj_18 obj_17)
       (pred_12 obj_18 obj_27)
       (pred_12 obj_18 obj_25)
       (pred_12 obj_27 obj_29)
       (pred_12 obj_27 obj_18)
       (pred_12 obj_14 obj_01)
       (pred_12 obj_14 obj_26)
       (pred_12 obj_14 obj_07)
       (pred_12 obj_26 obj_02)
       (pred_12 obj_26 obj_23)
       (pred_12 obj_26 obj_05)
       (pred_12 obj_26 obj_14)
       (pred_12 obj_23 obj_30)
       (pred_12 obj_23 obj_17)
       (pred_12 obj_23 obj_25)
       (pred_12 obj_23 obj_26)
       (pred_12 obj_17 obj_20)
       (pred_12 obj_17 obj_29)
       (pred_12 obj_17 obj_18)
       (pred_12 obj_17 obj_23)
       (pred_12 obj_29 obj_15)
       (pred_12 obj_29 obj_27)
       (pred_12 obj_29 obj_17)
       (pred_12 obj_01 obj_19)
       (pred_12 obj_01 obj_02)
       (pred_12 obj_01 obj_14)
       (pred_12 obj_02 obj_22)
       (pred_12 obj_02 obj_30)
       (pred_12 obj_02 obj_26)
       (pred_12 obj_02 obj_01)
       (pred_12 obj_30 obj_21)
       (pred_12 obj_30 obj_20)
       (pred_12 obj_30 obj_23)
       (pred_12 obj_30 obj_02)
       (pred_12 obj_20 obj_11)
       (pred_12 obj_20 obj_15)
       (pred_12 obj_20 obj_17)
       (pred_12 obj_20 obj_30)
       (pred_12 obj_15 obj_03)
       (pred_12 obj_15 obj_29)
       (pred_12 obj_15 obj_20)
       (pred_12 obj_19 obj_06)
       (pred_12 obj_19 obj_22)
       (pred_12 obj_19 obj_01)
       (pred_12 obj_22 obj_10)
       (pred_12 obj_22 obj_21)
       (pred_12 obj_22 obj_02)
       (pred_12 obj_22 obj_19)
       (pred_12 obj_21 obj_08)
       (pred_12 obj_21 obj_11)
       (pred_12 obj_21 obj_30)
       (pred_12 obj_21 obj_22)
       (pred_12 obj_11 obj_24)
       (pred_12 obj_11 obj_03)
       (pred_12 obj_11 obj_20)
       (pred_12 obj_11 obj_21)
       (pred_12 obj_03 obj_04)
       (pred_12 obj_03 obj_15)
       (pred_12 obj_03 obj_11)
       (pred_12 obj_06 obj_10)
       (pred_12 obj_06 obj_19)
       (pred_12 obj_10 obj_08)
       (pred_12 obj_10 obj_22)
       (pred_12 obj_10 obj_06)
       (pred_12 obj_08 obj_24)
       (pred_12 obj_08 obj_21)
       (pred_12 obj_08 obj_10)
       (pred_12 obj_24 obj_04)
       (pred_12 obj_24 obj_11)
       (pred_12 obj_24 obj_08)
       (pred_12 obj_04 obj_03)
       (pred_12 obj_04 obj_24)
       (pred_2 obj_17)
       (pred_2 obj_10)
       (pred_2 obj_04)
       (pred_10  obj_17 obj_13)
       (pred_10  obj_10 obj_28)
       (pred_10  obj_04 obj_13)
       (pred_3 obj_07)
       (pred_3 obj_05)
       (pred_3 obj_25)
       (pred_3 obj_18)
       (pred_3 obj_27)
       (pred_3 obj_14)
       (pred_3 obj_26)
       (pred_3 obj_23)
       (pred_3 obj_29)
       (pred_3 obj_01)
       (pred_3 obj_02)
       (pred_3 obj_30)
       (pred_3 obj_20)
       (pred_3 obj_15)
       (pred_3 obj_19)
       (pred_3 obj_22)
       (pred_3 obj_21)
       (pred_3 obj_11)
       (pred_3 obj_03)
       (pred_3 obj_06)
       (pred_3 obj_08)
       (pred_3 obj_24)

       (pred_4  obj_16 obj_13)
       (pred_4  obj_12 obj_28)
       (pred_4  obj_09 obj_28)
       (pred_5 obj_16 obj_25)
       (pred_5 obj_12 obj_21)
       (pred_5 obj_09 obj_20)
       (pred_8 obj_18)
    )

    (:goal (and
       (pred_5 obj_16 obj_22)
    ))
(:constraints
  (always (not (pred_8 obj_02)))
)
)

; plan
1. (op_5 obj_18 obj_25)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_25)
   goals met: 0 of 1
2. (op_1 obj_25 obj_16)
   deleted: (pred_5 obj_16 obj_25) (pred_7)
   added: (pred_11 obj_16)
   goals met: 0 of 1
3. (op_5 obj_25 obj_23)
   deleted: (pred_8 obj_25)
   added: (pred_8 obj_23)
   goals met: 0 of 1
4. (op_5 obj_23 obj_30)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_30)
   goals met: 0 of 1
5. (op_5 obj_30 obj_21)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_21)
   goals met: 0 of 1
6. (op_5 obj_21 obj_22)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_22)
   goals met: 0 of 1
7. (op_3 obj_22 obj_16)
   deleted: (pred_11 obj_16)
   added: (pred_7) (pred_5 obj_16 obj_22)
   goals met: 1 of 1
